Repository: kddlb/aitranslate-flutter
Catalog: lib/l10n/app_*.arb
Languages: es

# firstRunAlertTitle
source: A Gemini API key is required.
es: Se requiere una clave API de Gemini.

# firstRunAlertDescription
source: The API key is stored in your device and is sent directly to the Gemini API.
es: La clave API se almacena en tu dispositivo y se envía directamente a la API de Gemini.

# firstRunAlertLinkOut
source: Get from AI Studio
es: Obtener del AI Studio

# firstRunAlertSet
source: Set
es: Establecer

# clearTextTooltip
source: Clear text
es: Limpiar texto

source: Settings
es: Ajustes

# sourceTextLabel
source: Source text
es: Texto de origen

# translationLabel
source: Translation
es: Traducción

# translateButton
source: Translate
es: Traducir

# apiKeyRequired
source: A Gemini API key is required.
es: Se requiere una clave API de Gemini.

# apiKeyRequiredAction
source: Set
es: Establecer

# settingsApiKeyLabel
source: Gemini API key
es: Clave API de Gemini

# settingsApiKeyValidatorRequired
source: An API key is required.
es: Se requiere una clave API.

# settingsScrollAutomatically
source: Scroll automatically when receiving translation
es: Desplazarse automáticamente al recibir la traducción

# settingsSystemMessageLabel
source: System instruction
es: Instrucción del sistema

# settingsSystemMessageLanguageRecommendation
source: It is recommended that the system instruction contains a language.
es: Se recomienda que esta instrucción contenga el nombre de un idioma.

# settingsSystemMessageValidatorRequired
source: A system instruction is required.
es: Se requiere una instrucción del sistema.

# settingsFontSize
source: Font size
es: Tamaño de fuente

# copy
source: Copy from translation
es: Copiar desde traducción

# paste
source: Paste to source
es: Pegar a origen
